export const DIVINATION_OPTIONS = [
    {
        label: '塔罗牌（三张牌占卜法）',
        key: 'tarot-3',
        rule: '通用型占卜牌陣，可自由定義應用於多種場合，不受限制地占卜相關事物或用來分析獨立事件的某個面向。\n這是萬用型牌陣，適用於所有場合，常用於簡單事物的占卜，根據牌面進行解讀，直指核心。一般占卜時使用本牌陣，效果很好，新手也適合。\n\n需要 3 張牌'
    },
    {
        label: '塔罗牌-维纳斯牌阵（八张牌）',
        key: 'tarot-venus',
        rule: '維納斯牌陣直指未來，有著超然的力量，預測愛情直指核心。真實快速地切入未來，是難得的經典塔羅牌陣。\n本牌陣適合婚姻、戀愛方面的未來指向占卜，是分析愛情未來的牌陣，可以看到雙方未來的狀況。如果你想占卜自己愛情的未來，維納斯牌陣是首選。\n\n需要 8 張牌'
    },
    // {
    //     label: '姻缘',
    //     key: 'fate',
    // },
    // {
    //     label: '生辰八字',
    //     key: 'birthday',
    // },
    // {
    //     label: '起名',
    //     key: 'new_name',
    // },
    // {
    //     label: '姓名五格',
    //     key: 'name',
    // },
    // {
    //     label: '周公解梦',
    //     key: 'dream',
    // },
    // {
    //     label: '梅花易数',
    //     key: 'plum_flower',
    // },
];

export const ABOUT = `# 关于 & 名词解释

## 塔罗牌

塔罗牌（Tarot Cards）是一种起源于欧洲的占卜工具，常用于预测未来、探索内心和提供指导。它由一副包含78张卡牌的牌组组成，每张牌都有特定的图案和象征意义。

塔罗牌最早被认为起源于15世纪的意大利，最初并非用于占卜，而是用作纸牌游戏。然而，随着时间的推移，人们开始将其用于占卜和心灵探索。塔罗牌在18世纪末和19世纪初逐渐流行起来，成为心灵和神秘主义领域的重要工具。

一副标准的塔罗牌包含两个主要部分：大阿卡纳（Major Arcana）和小阿卡纳（Minor Arcana）。大阿卡纳由22张牌组成，每张牌都代表着不同的象征和主题，如命运、力量、正义等。小阿卡纳则包含56张牌，分为四个花色，分别是权杖、圣杯、宝剑和金币，每个花色包含10张数值牌和4张面值牌。

使用塔罗牌进行占卜时，占卜者通常会根据提问者的问题或者目的，从牌组中抽取一定数量的牌，并根据牌面的象征意义进行解读。每张牌都有独特的含义，结合占卜者的直觉和经验，可以提供对过去、现在和未来的洞察，以及对个人内在世界的反思和指导。

需要注意的是，塔罗牌不是预测命运的工具，而是提供了一种反思和指导的方式。占卜的结果和解读可以因个人的解读角度、经验和直觉而有所不同。因此，使用塔罗牌时应持有开放的心态，将其作为一个工具来启发思考和探索内心世界，而不是将其作为绝对真理。

本系统支持以下占卜法：

“三张牌占卜法”，适用于综合分析或单事解读。使用通用型占卜牌阵，可以自由定义应用于多种场合，不受限制地占卜相关事务或用来分析独立事件的某个面向。这个是万用型牌阵，适用于所有场合，常用语简单事务的占卜，根据牌面进行解读，直指核心。一般占卜时使用此牌阵效果很好，适合新手。

“维纳斯牌组”，維納斯牌陣直指未來，有著超然的力量，預測愛情直指核心。真實快速地切入未來，是難得的經典塔羅牌陣。本牌陣適合婚姻、戀愛方面的未來指向占卜，是分析愛情未來的牌陣，可以看到雙方未來的狀況。如果你想占卜自己愛情的未來，維納斯牌陣是首選。需要 8 張牌。
`

export default {}
